# Use `brew bundle` to manage Homebrew packages, casks, and taps.
# To install: `brew bundle install`

# --- Core Development Tools & Languages ---
# brew "node" # JavaScript runtime and package manager (npm/yarn via corepack)
# brew "mise" # A multi-language version manager (like asdf or nvm/rbenv/pyenv combined)
# brew "gdb"  # A powerful debugger for C/C++ and other languages (GNU Debugger)

# --- Terminal Utilities & Enhancements ---
brew "tmux"
brew "fish"       # User-friendly command line shell with autosuggestions and syntax highlighting
# brew "starship"   # Cross-shell prompt that's fast, customizable, and shows useful context
# brew "zellij"     # A terminal workspace and multiplexer, alternative to tmux/screen
brew "bat"        # A 'cat' clone with syntax highlighting, Git integration, and line numbers
brew "glow"       # Preview beautiful markdown in the CLI (charmbracelet)
brew "fd"         # A fast and user-friendly alternative to 'find'
brew "ripgrep"    # A very fast, recursive, case-sensitive grep utility (often used for code search)
brew "lsd"        # A modern 'ls' command with colors, icons, and tree view
brew "htop"       # An interactive process viewer, alternative to 'top'
# brew "lnav"       # A log file navigator with live tailing, regex searching, and SQL querying
# brew "sad"        # A modern, interactive find-and-replace CLI tool (stream editor alternative)
# brew "viddy"      # A modern 'watch' command, for running commands periodically and showing output changes
brew "ranger"     # Visual file manager with Vim-like keybindings and a preview pane

# --- Git & Version Control ---
brew "git-delta"  # A syntax-highlighting pager for Git, diff, and grep output (highly recommended!)
brew "git-lfs"    # Git Large File Storage, for handling large binary files efficiently
brew "difftastic" # A structural diff tool that understands code syntax (often better than traditional line-based diffs)
# brew "jj"         # Jujutsu - an experimental, user-friendly Git-compatible version control system
# brew "repomix"    # A tool to synchronize Git repositories and branches (useful for mono-repos or complex setups)
brew "lazygit"    # A simple terminal UI for Git, making it easier to visualize and manage repositories

# --- Security & Credentials ---
# brew "gnupg" # GNU Privacy Guard, for encryption and signing (often used with Git commit signing)
# brew "pass"  # The standard Unix password manager

# --- AI & Large Language Models ---
# brew "llm" # Command-line utility for interacting with Large Language Models

# --- Other CLI Tools ---
# brew "block-goose-cli" # [Assuming this is a specific tool you use - add a more specific description if known]
#                        # Example: "CLI tool for interacting with the Block Goose platform/service"
brew "stow"           # A symlink farm manager, commonly used for managing dotfiles

# --- Editors & IDEs ---
brew "neovim" # A highly extensible Vim-based text editor (modern fork of Vim)

# --- Fonts & Terminal Emulators (Casks) ---
# cask "font-hack-nerd-font" # A popular programming font patched with glyphs for powerline, icons, etc.
# cask "wezterm"             # A GPU-accelerated cross-platform terminal emulator
